app/controllers/credits_controller.rb

SELECT * FROM `users` WHERE (`users`.`username` = 'patwoodward') LIMIT 1
---
  def index
    @user = User.find_by_username(params[:username])

SELECT * FROM `credits` WHERE (`credits`.`id` = 2)
---
  def show
    @credit = Credit.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT * FROM `credits` WHERE (`credits`.`id` = 2 AND (`credits`.user_id = 2))
---
  def edit
    @user = User.find(params[:user_id])
    @credit = @user.credits.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
INSERT INTO `credits` (`location`, `created_at`, `updated_at`, `role`, `project`, `user_id`, `note`) VALUES('', '2011-04-17 21:32:05', '2011-04-17 21:32:05', '', '', 1, '')
---
  def create
    @user = User.find(params[:user_id])
    @credit = @user.credits.new(params[:credit])

    respond_to do |format|
      if @credit.save

SELECT * FROM `credits` WHERE (`credits`.`id` = 2)
UPDATE `credits` SET `updated_at` = '2011-04-25 03:33:44', `note` = 'testt' WHERE `id` = 2
---
  def update
    @credit = Credit.find(params[:id])

    respond_to do |format|
      if @credit.update_attributes(params[:credit])